---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidType.GetBasicIEnumerator
source: html/8036c0e2-44b5-02e2-34e3-9d84261c1f83.htm
---
# Autodesk.Revit.DB.Plumbing.FluidType.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.